import "./questionAndAnswer.scss"
import Sidebar from "../../components/sidebar/Sidebar"
import Navbar from "../../components/navbar/Navbar"
import QuestionTable from "../../pages/QuestionAnsAnswer/QuestionTable"

export const QuestionAndAnswer = () => {
  return (
    <div className='list'>
    <Sidebar/>
    <div className="listContainer">
     <Navbar/> 
     <div className="listContainer">
     <QuestionTable /> 
     
    {/* <div >
      <h1 className="header">དྲི་བ་དང་ལན།</h1>
      <div className="first">༡༽སྒྲིག་ལམ་རྣམ་གཞག་འདི་ག་ཅི་སྨོ </div>
      <div className="second">ལན ༔  ལུས་ངག་ཡིད་གསུམ་གྱི་བྱ་སྤོད་ཚུ་ ག་ཅི་རང་འབད་རུང་ མི་གཅིག་གིས་ འབད་དོ་བཟུམ་སྒྲིག་ཏོག་ཏོ་འབད་མི་ལུ་ སྒྲིག། སྔོན་བྱོན་རྒྱལ་བ་གོངམ་ཚུ་གིས་ མཛད་སྲོལ་ཡོད་པའི་ལམ་དེ་ ཤུལ་མམ་ ཚུ་གིས་ཉམས་མ་བཅུག་པར་ མི་རབས་ལས་མི་རབས་བརྒྱུད་དེ་ བདག་ཏུ་ བཟུང་སྟེ་ ལག་ལེན་འཐབ་ནིའི་ལམ་འབད་ནི་དེ་གིས་ ལམ། འདི་བཟུམ་མའི་ལམ་སྲོལ་ཚུ་ མ་འོངས་བུ་གཞི་ཚུ་གིས་ སེམས་ལས་ནམ་ ཡང་མི་བརྗེད་པར་ ལག་ལེན་འཐབ་ཚུགས་པའི་དོན་ལུ་ སྒྲིག་ལམ་གྱི་གོ་ རིམ་ཚུ་ བཀོད་དེ་བཞག་མི་ལུ་ རྣམ་གཞག་ཟེར་སླབ་ཨིན། </div>

      <div className="first">༢༽ ཕོ་རྒྱ་གི་བགོ་ལུ་མ་གསུམ་དང་ཟུར་ཚིག་དྲུག་ཡོད་མི་འདི་ག་ཅི་སྨོ </div>
      <div className="second">ལན ༔ བགོ་ལུ་མ་གསུམ་ཡོད་མི་འདི་ གཞི་འཇིག་རྟེན་ཡང་དག་པའི་ལྟ་བ་དཀོན་མཆོག་གསུམ་བླ་མར་རྩིས་ཤིང་ ལས་རྒྱུ་འབྲས་ཡྲོད་པར་ལྟ་བ་ ལམ་ཆོས་སྲིད་བཟུང་འབྲེལ་གྱི་ཁྱབ་སྲིད་ལུ་ དད་མོས་ཡོད་པ་འབྲས་བུ་གནས་སབས་དང་མཐར་ཐུག་གི་བར་དོན་ཨིན། ཟུར་ཚིག་དྲུག་ཡོད་མི་འདི་ མི་བོ་གདུང་དྲུག་གི་བུ་བརྒྱུད་དར་ཞིང་རྒྱས་པའི་རྟགས། མ་དང་ཟུར་ཚིག་དྲུག་པོ་ གྲོང་གཅིག་གི་འོག་ལུ་སྡུད་མི་འདི་ རྒྱལ་ཁབ་ཀྲི་འབངས་གཞུང་གེ་ར་ ཆོས་སྲིད་གཉིས་ཀྱི་བདག་ཉིད་ མངའ་བདག་རྒྱལ་པོ་གཅིག་གི་འོག་ལུ་བསྡུ་བའི་བརྡ་ཨིན།</div>

      <div className="first">༣༽ ཕོ་རྒྱ་གི་བགོ་ལུ་ ཕྱི་ཤབས་དང་ནང་ཤབས་གཉིས་ཡོད་མི་འདི་ག་ཅི་གྱི་རྟགས་སྨོ</div>
      <div className="second">ལན ༔ ཕོ་རྒྱ་གི་བགོ་ལུ་ ཕྱི་ཤབས་དང་ནང་ཤབས་གཉིས་ཡོད་མི་འདི་ ཕྱི་དགྲ་ཐབས་ཀྱི་བཏུལ་ཞིང་ ནང་གཉེན་བྱམས་པས་སྐྱོང་བའི་བརྡ་ཨིན།</div>

      <div className="first">༤༽ ཕོ་རྒྱ་གྱི་གོ་ སྒྲོག་ཐག་བསྡམས་མི་འདི་ག་ཅིག་གི་རྟགས་སྨོ</div>
      <div className="second">ལན ༔ ཕོ་རྒྱ་གྱི་གོ་ སྒྲོག་ཐག་བསྡམས་མི་འདི་ཐ་དམ་ཚིག་དར་གྱི་མདུད་ཕད་ བཟུམ་ དམ་པོར་གནས་པའི་བར་ཨིན།</div>

      <div className="first">༥༽ ཕོ་རྒྱ་གྱི་སྟོད་གོང་ཕྱི་ཁར་སློག་མི་འདི་ག་ཅིག་གི་རྟགས་སྨོ</div>
      <div className="second">ལན ༔ སྟོད་གོང་ཕྱི་ཁར་སློག་མི་འདི་ ཕོའི་དཔའ་རྩལ་ཕྱི་ཁར་ངོམས་པའི་བརྡ་ཨིན། </div>

      <div className="first">༦༽ ལག་རྒྱན་ཕྱི་ཁར་སློག་མི་འདི་ག་ཅིག་གི་རྟགས་སྨོ</div>
      <div className="second">ལན ༔ ལག་རྒྱན་ཕྱི་ཁར་སློག་མི་འདི་ ནང་གི་ལྷག་བསམ་དཀར་པོ་ཕྱི་ཁར་ངོམས་ པའི་བར་ཨིན། </div>

      <div className="first">༧༽ བགོ་གི་རྒྱབ་ཀྱི་སྡེབ་གྱ་ བལྟབ་གཉིས་འདི་ག་ཅི་གི་ཚུལ་སྨོ</div>
      <div className="second">ལན ༔  བགོ་གི་རྒྱབ་ཀྱི་སྡེབ་གྱ་ བལྟབ་གཉིས་འདི་ ཆོས་དང་འཇིག་རྟེན་གྱི་བྱ་བ་གལ་ཆེ་ དྲགས་ཚུ་མཐར་ཕྱིན་པའི་བར་ཨིན།</div>

      <div className="first">༨༽ སྐེ་རགས་འདི་ག་ཅི་འབད་བཅིངས་སྨོ</div>
      <div className="second">ལན ༔ སྐེ་རགས་བཅིངས་མི་འདི་ རྒྱལ་ཁབ་ཀྱི་མི་རིགས་ཚུ་ དམ་ཚིག་གཅིག་སྒྲིལ་ དུ་གནས་པའི་བར་ཨིན།</div>

      <div className="first">༩༽ དཀྱི་ར་ལུ་མ་གསུམ་མཐའ་མ་ རལཔ་ལྷག་མི་འདི་ག་ཅི་རྟགས་སྨོ</div>
      <div className="second">ལན ༔ དཀྱི་ར་ལུ་མ་གསུམ་མཐའ་མ་ རལཔ་ལྷག་མི་འདི་་གོང་གི་བགོ་གི་མ་གསུམ་ དང་འདྲ་བའི་ཁར་ བུད་མེད་ཀྱི་ཁྱད་ཆོས་ ཤེས་རབ་གསུམ་གྱིས་ ལྷག་པའི་བརྡ་ཨིན།</div>

      <div className="first">༡༠༽ དཀྱིས་རའི་ཁ་འཇགས་གཉིས་འབད་ཡོད་མི་འདི་ག་ཅི་བརྡ་སྨོ</div>
      <div className="second">ལན ༔ དཀྱིས་རའི་ཁ་འཇགས་གཉིས་འབད་ཡོད་མི་འདི་་ཐབས་ཤེས་ཟུང་ འབྲལ་གྱི་ཁྱད་ཆོས་ཚང་བའི་བརྡ་ཨིན། </div>

      <div className="first">༡༡༽མོ་གྱི་གྱོན་ཆས་རྐོ་མ་གཉིས་ལུ་ རྒྱབ་ཐག་བཏགས་མི་འདི་ག་ཅི་རྟགས་སྨོ</div>
      <div className="second">ལན༽  རྐོ་མ་གཉིས་ལུ་ རྒྱབ་ཐག་བཏགས་མི་འདི་ ཁྱིམ་ནང་གི་འཛིན་སྐྱོང་ གི་ལཱ་ལུ་ ཉེ་རིང་མེད་པའི་སྐྱོང་བཞག་འཐབ་ཚུགས་པའི་བར་ཨིན།</div>

      <div className="first">༡༢༽ ཨམ་སྲུ་ཚུ་དཀྱི་ར་རྐང་ཚིགས་མ་མཐོངམ་འབད་ག་ཅི་འབད་རྒྱོནམ་ཨིན་ན</div>
      <div className="second">ལན ༔ ཨམ་སྲུ་ཚུ་དཀྱི་ར་རྐང་ཚིགས་མ་མཐོངམ་འབད་དམའ་བར་གྱོན་མི་འདི་ གུས་ བཀུར་ཞུ་བའི་བར་ཨིན།</div>

      <div className="first">༡༣༽ ཨམ་སྲུ་ཚུ་ཕྱི་ལས་སྟོད་བགོ་ག་ཅི་འབད་གྱོནམ་ཨིན་ན</div>
      <div className="second">ལན ༔  ཨམ་སྲུ་ཚུ་ཕྱི་ལས་སྟོད་བགོ་གྱོན་མི་འདི་ ཁྲེལ་དང་ངོ་ཚ་ཡོད་པའི་བརྡ་ཨིན།</div>

      <div className="first">༡༤༽ འོན་འཇུའི་གོང་དང་ ལག་མགོ་ཕྱི་ཁར་སློག་མི་འདི་ག་ཅི་རྟགས་སྨོ</div>
      <div className="second">ལན ༔ འོན་འཇུའི་གོང་དང་ ལག་མགོ་ཕྱི་ཁར་སློག་མི་འདི་ བྱམས་སེམས་ ཀྱིས་ གཞན་ཚུ་སྐྱོང་བའི་བརྡ་ཨིན།</div>

      <div className="first">༡༥༽ བཀབ་ནེའི་ཁུངས་དང་དགོས་པ་ག་ཅི་སྨོ</div>
      <div className="second">ལན ༔ བཀབ་ནེ་བཀབ་དགོ་མི་འདི་ སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ འཁོར་ རྣམ་པ་བཞི་ལུ་འདུལ་ཁྲིམས་བཅའཝ་ད་ དགེ་སློང་ཚུ་ལུ་ གཙོ་བོ་གུས་ ཞབས་ཀྱི་དོན་ལུ་གནངམ་མ་ཚད་ དུས་རབས་བརྒྱད་པའི་ནང་ གུ་རུ་རིན་པོ་ཆེ་ འབྲུག་ལུ་བྱོན་ཏེ་ འབྲུགཔ་ཚུ་གྱིས་ སྲོག་མི་གཅོད་ལ་སོགས་པའི་ དགེ་བསྙེན་གྱི་སྡོམ་པ་གནང་སྐབས་ དགེ་སློང་གྱི་རིགས་ཆོས་གོས་རང་ འཇགས་བཞག་སྟེ་ མི་སེར་སྤྱིར་བཏང་ལུ་ བཀབ་ནེ་ཚོས་གཞི་དཀརཔོ་ འབད་གནང་སྟེ་ གཙོ་བོ་ཆོས་ཀྱི་མཛད་སྒོ་དང་འབྲེལ་བའི་སྐབས་ གུས་ཞབས་ཀྱི་དོན་ལུ་ བཀབ་སྲོལ་བཙུགས་གནངམ་ཨིན་པས། དེའི་ཤུལ་ལས་ དུས་རབས་ ༡༧ པའི་ནང་ ཞབས་དྲུང་གྲིས་ཆོས་སྲིད་ལུགས་གཉིས་ཀྱི་ དབུ་གཞུང་བཙུགས་སྐབས་ དགེ་འདུན་གྱི་སྡེ་ལུ་ ཐུགས་གཙིགས་ཆེཝ་ལས་ལུགས་ གཉིས་ཁ་ལོ་བསྒྱུར་བའི་དཔོན་ཁག་ཡང་ དགེ་སློང་གྱི་གྲལ་ལས་ བསྐོས་ཏེ་ ལྷན་རྒྱས་དང་གཉིས་སྐལམ་ལ་སོགས་པའི་ན་བཟའི་དབྱེ་བ་སོ་སོར་བཟོ་གནངམ་མ་ཚད་ ད་ལྟོའི་རྒཔོ་ཚུ་གི་བཀབ་ནེ་དེ་ཡང་ དེ་བསྒང་ ལས་རང་ རྟོགས་ལྡན་སྒརཔ་ཟེར་དོན་ལུ་ གོས་དཀར་སྔགས་ཆས་འབད་ མཛད་གནང་ནུག། རྒྱལ་བརྒྱུད་ཀྱི་གཞུང་དབུ་བརྙེས་ཞིནམ་ལས་ བློན་པོ་ ལྷན་རྒྱས་གོང་འོག་དང་ གཉིས་སྐལམ་ ཆིབས་གཞོནམ་དང་རབ་འབྱམས་ ལ་སོགས་པའི་ གོ་སའི་རྟགས་ཀྱི་བཀབ་ནེའི་དབྱ་བ་སོ་སོར་མཛད་གནང་ནུག།</div>

      <div className="first">༡༦༽ བཀབ་ནེ་འདི་ག་དེ་འབད་བཀབ་ནི་སྨོ</div>
      <div className="second">ལན ༔ བཀབ་ནེ་འདི་ག་དོ་འབད་བཀབ་ནི་སྨོ་ཟེར་བ་ཅིན་ བཀབ་ནེ་མཐའམ་གཅིག་དཔུང་གཡས་པའི་གུ་ལས་ ལགཔ་གཡས་པ་གྱིས་ བཟུང་ཞིན་ན་ བཀབ་ནེ་ཕྱེད་ཀ་ལགཔ་གཡོན་པ་གྱིས་ རྒྱབ་ལས་ཨོག་སྟེ་ མཆན་ལོགས་གཡོན་པའི་འོག་ལས་བཏོན་ ལགཔ་གཡས་པ་གིས་བཟུང་ བའི་བཀབ་ནེ་མཐའམ་དེ་ དཔུང་གཡོན་པའི་འོག་ལས་ བཀབ་ནེའི་རལཔ་ འདི་རྒྱབ་ཁར་བཏང་། བཀབ་ནེ་ངོ་བོའི་ཨོག་གྱི་ནང་ལས་བཏོན་ ལགཔ་ གཡོན་པ་གྱིས་བཟུང་བའི་མཐའམ་དེ་ ལགཔ་གཡས་པས་ལག་མགོ་བསྐོར་ ཞིནམ་ལས་ དཔུང་གཡོན་པའི་མགུ་ལས་རལ་པ་མདུན་ཕྱོགས་ལུ་བཏང་ དགོཔ་ཨིན། </div>
</div> */}
    </div>
    </div>
  </div>
    
  )
}